UTAF_Base/requestFiles/BPS_Account_GetDetailsExt.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v2.account.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
     <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <!--Optional:-->
         <urn:endUserId>id000000</urn:endUserId>
         <!--Optional:-->
         <urn:endUserLanguage>EN</urn:endUserLanguage>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataGetDetailsExt version="2.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:billingAccountId>${Req_billingAccountId}</urn1:billingAccountId>
         <urn1:partyId>${Req_partyId}</urn1:partyId>
         <urn1:paymentAgreementId>${Req_paymentAgreementId}</urn1:paymentAgreementId>
      </urn1:RequestDataGetDetailsExt>
   </soapenv:Body>
</soapenv:Envelope>